JSB2500/STM32H743-Nucleo-projects/Shared-/nrf24.c
// Functions to manage the nRF24L01+ transceiver

#include <stdio.h>
#include "nrf24.h"
#include "uart.h"

///////////////////////////////////////////////////////////////////////////////
// nRF24L01+ chip:

// Instructions:
#define nRF24_CMD_R_REGISTER       (uint8_t)0x00 // Register read
#define nRF24_CMD_W_REGISTER       (uint8_t)0x20 // Register write
#define nRF24_CMD_R_RX_PAYLOAD     (uint8_t)0x61 // Read RX payload
#define nRF24_CMD_W_TX_PAYLOAD     (uint8_t)0xA0 // Write TX payload
#define nRF24_CMD_FLUSH_TX         (uint8_t)0xE1 // Flush TX FIFO
#define nRF24_CMD_FLUSH_RX         (uint8_t)0xE2 // Flush RX FIFO
#define nRF24_CMD_REUSE_TX_PL      (uint8_t)0xE3 // Reuse TX payload
#define nRF24_CMD_LOCK_UNLOCK      (uint8_t)0x50 // Lock/unlock exclusive features
#define nRF24_CMD_NOP              (uint8_t)0xFF // No operation (used for reading status register)

// Registers:
#define nRF24_REG_CONFIG           (uint8_t)0x00 // Configuration register
#define nRF24_REG_EN_AA            (uint8_t)0x01 // Enable "Auto acknowledgment"
#define nRF24_REG_EN_RXADDR        (uint8_t)0x02 // Enable RX addresses
#define nRF24_REG_SETUP_AW         (uint8_t)0x03 // Setup of address widths
#define nRF24_REG_SETUP_RETR       (uint8_t)0x04 // Setup of automatic retransmit
#define nRF24_REG_RF_CH            (uint8_t)0x05 // RF channel
#define nRF24_REG_RF_SETUP         (uint8_t)0x06 // RF setup register
#define nRF24_REG_STATUS           (uint8_t)0x07 // Status register
#define nRF24_REG_OBSERVE_TX       (uint8_t)0x08 // Transmit observe register
#define nRF24_REG_RPD              (uint8_t)0x09 // Received power detector
#define nRF24_REG_RX_ADDR_P0       (uint8_t)0x0A // Receive address data pipe 0
#define nRF24_REG_RX_ADDR_P1       (uint8_t)0x0B // Receive address data pipe 1
#define nRF24_REG_RX_ADDR_P2       (uint8_t)0x0C // Receive address data pipe 2
#define nRF24_REG_RX_ADDR_P3       (uint8_t)0x0D // Receive address data pipe 3
#define nRF24_REG_RX_ADDR_P4       (uint8_t)0x0E // Receive address data pipe 4
#define nRF24_REG_RX_ADDR_P5       (uint8_t)0x0F // Receive address data pipe 5
#define nRF24_REG_TX_ADDR          (uint8_t)0x10 // Transmit address
#define nRF24_REG_RX_PW_P0         (uint8_t)0x11 // Number of bytes in RX payload in data pipe 0
#define nRF24_REG_RX_PW_P1         (uint8_t)0x12 // Number of bytes in RX payload in data pipe 1
#define nRF24_REG_RX_PW_P2         (uint8_t)0x13 // Number of bytes in RX payload in data pipe 2
#define nRF24_REG_RX_PW_P3         (uint8_t)0x14 // Number of bytes in RX payload in data pipe 3
#define nRF24_REG_RX_PW_P4         (uint8_t)0x15 // Number of bytes in RX payload in data pipe 4
#define nRF24_REG_RX_PW_P5         (uint8_t)0x16 // Number of bytes in RX payload in data pipe 5
#define nRF24_REG_FIFO_STATUS      (uint8_t)0x17 // FIFO status register
#define nRF24_REG_DYNPD            (uint8_t)0x1C // Enable dynamic payload length
#define nRF24_REG_FEATURE          (uint8_t)0x1D // Feature register

// Addresses of the RX_PW_P# registers:
static const uint8_t nRF24_RX_PW_PIPE[6] =
{
  nRF24_REG_RX_PW_P0,
  nRF24_REG_RX_PW_P1,
  nRF24_REG_RX_PW_P2,
  nRF24_REG_RX_PW_P3,
  nRF24_REG_RX_PW_P4,
  nRF24_REG_RX_PW_P5
};

// Addresses of the RX/TX address registers:
static const uint8_t nRF24_ADDR_REGS[7] =
{
  nRF24_REG_RX_ADDR_P0,
  nRF24_REG_RX_ADDR_P1,
  nRF24_REG_RX_ADDR_P2,
  nRF24_REG_RX_ADDR_P3,
  nRF24_REG_RX_ADDR_P4,
  nRF24_REG_RX_ADDR_P5,
  nRF24_REG_TX_ADDR
};

// Register bits:
//
// CONFIG:
#define nRF24_CONFIG_PRIM_RX       (uint8_t)0x01 // PRIM_RX bit in CONFIG register
#define nRF24_CONFIG_PWR_UP        (uint8_t)0x02 // PWR_UP bit in CONFIG register
#define nRF24_CONFIG_RX_DR         (uint8_t)0x40 // RX_DR bit (data ready RX FIFO interrupt)
#define nRF24_CONFIG_TX_DS         (uint8_t)0x20 // TX_DS bit (data sent TX FIFO interrupt)
#define nRF24_CONFIG_MAX_RT        (uint8_t)0x10 // MAX_RT bit (maximum number of TX retransmits interrupt)

// Masks:
#define nRF24_MASK_REG_MAP         (uint8_t)0x1F // Mask bits[4:0] for CMD_RREG and CMD_WREG commands
#define nRF24_MASK_CRC             (uint8_t)0x0C // Mask for CRC bits [3:2] in CONFIG register
#define nRF24_MASK_STATUS_IRQ      (uint8_t)0x70 // Mask for all IRQ bits in STATUS register
#define nRF24_MASK_TX_PWR          (uint8_t)0x06 // Mask RF_PWR[2:1] bits in RF_SETUP register
#define nRF24_MASK_RX_P_NO         (uint8_t)0x0E // Mask RX_P_NO[3:1] bits in STATUS register
#define nRF24_MASK_DATARATE        (uint8_t)0x28 // Mask RD_DR_[5,3] bits in RF_SETUP register
#define nRF24_MASK_EN_RX           (uint8_t)0x3F // Mask ERX_P[5:0] bits in EN_RXADDR register
#define nRF24_MASK_RX_PW           (uint8_t)0x3F // Mask [5:0] bits in RX_PW_Px register
#define nRF24_MASK_RETR_ARD        (uint8_t)0xF0 // Mask for ARD[7:4] bits in SETUP_RETR register
#define nRF24_MASK_RETR_ARC        (uint8_t)0x0F // Mask for ARC[3:0] bits in SETUP_RETR register
#define nRF24_MASK_RXFIFO          (uint8_t)0x03 // Mask for RX FIFO status bits [1:0] in FIFO_STATUS register
#define nRF24_MASK_TXFIFO          (uint8_t)0x30 // Mask for TX FIFO status bits [5:4] in FIFO_STATUS register
#define nRF24_MASK_PLOS_CNT        (uint8_t)0xF0 // Mask for PLOS_CNT[7:4] bits in OBSERVE_TX register
#define nRF24_MASK_ARC_CNT         (uint8_t)0x0F // Mask for ARC_CNT[3:0] bits in OBSERVE_TX register
///////////////////////////////////////////////////////////////////////////////

static uint8_t nRF24_ReadReg(uint8_t reg)
{
  uint8_t TxData[2], RxData[2];
  uint8_t Result;

  TxData[0] = nRF24_CMD_R_REGISTER | (reg & nRF24_MASK_REG_MAP );
  TxData[1] = nRF24_CMD_NOP;

  nRF24_CSN_L();
  do
  {
  } while (nRF24_LL_RW(TxData, RxData, 2) != HAL_OK); // Will hang on error, by design.
  nRF24_CSN_H();

  Result = RxData[1];

  return Result;
}

static void nRF24_WriteReg(uint8_t reg, uint8_t value)
{
  uint8_t TxData[2], RxData[2];

  nRF24_CSN_L();

  if ((reg == nRF24_CMD_FLUSH_TX ) || (reg == nRF24_CMD_FLUSH_RX ) || (reg == nRF24_CMD_REUSE_TX_PL ) || (reg == nRF24_CMD_NOP ))
  {
    do
    {
    } while (nRF24_LL_RW(&reg, RxData, 1) != HAL_OK); // Will hang on error, by design.
  }
  else
  {
    // If register...
    if ((reg & 0xC0) == 0x00)
      reg = nRF24_CMD_W_REGISTER | (reg & nRF24_MASK_REG_MAP );

    TxData[0] = reg;
    TxData[1] = value;
    do
    {
    } while (nRF24_LL_RW(TxData, RxData, 2) != HAL_OK); // Will hang on error, by design.
  }

  nRF24_CSN_H();
}

