JSB2500/STM32H743-Nucleo-projects/Shared-/nrf24.c
static void nRF24_ReadMBReg(uint8_t reg, uint8_t *pBuf, uint8_t NumBytes)
{
  uint8_t i;
  uint8_t TxData[32];
  uint8_t RxData;

  // assert_param(NumBytes<=32); // JSB: I can't use this because enabling assert_param results in a PLLR value error. CubeMX problem?
  if (NumBytes > 32)
    return; // !!! Error condition.

  for (i = 0; i < NumBytes; ++i)
    TxData[i] = nRF24_CMD_NOP;

  nRF24_CSN_L();
  do
  {
  } while (nRF24_LL_RW(&reg, &RxData, 1) != HAL_OK); // Will hang on error, by design.
  do
  {
  } while (nRF24_LL_RW(TxData, pBuf, NumBytes) != HAL_OK); // Will hang on error, by design.
  nRF24_CSN_H();
}

static void nRF24_WriteMBReg(uint8_t reg, uint8_t *pBuf, uint8_t NumBytes)
{
  uint8_t RxData[32];

  // assert_param(NumBytes<=32); // JSB: I can't use this because enabling assert_param results in a PLLR value error. CubeMX problem?
  if (NumBytes > 32)
    return; // !!! Error condition.

  reg |= nRF24_CMD_W_REGISTER; // JSB: This converts register values to write commands and doesn't affect any other multi-byte write commands.

  nRF24_CSN_L();
  do
  {
  } while (nRF24_LL_RW(&reg, RxData, 1) != HAL_OK); // Will hang on error, by design.
  do
  {
  } while (nRF24_LL_RW(pBuf, RxData, NumBytes) != HAL_OK); // Will hang on error, by design.
  nRF24_CSN_H();
}

// Set transceiver to it's initial state.
// Note: RX/TX addresses remains unchanged.
void nRF24_Init(void)
{
  // Write to registers their initial values
  nRF24_WriteReg(nRF24_REG_CONFIG, 0x78);
  nRF24_WriteReg(nRF24_REG_EN_AA, 0x3F);
  nRF24_WriteReg(nRF24_REG_EN_RXADDR, 0x00); //!!!JSB Was 0x03
  nRF24_WriteReg(nRF24_REG_SETUP_AW, 0x03);
  nRF24_WriteReg(nRF24_REG_SETUP_RETR, 0x03);
  nRF24_WriteReg(nRF24_REG_RF_CH, 0x02);
  nRF24_WriteReg(nRF24_REG_RF_SETUP, 0x0E);
  nRF24_WriteReg(nRF24_REG_STATUS, 0x00);
  nRF24_WriteReg(nRF24_REG_RX_PW_P0, 0x00);
  nRF24_WriteReg(nRF24_REG_RX_PW_P1, 0x00);
  nRF24_WriteReg(nRF24_REG_RX_PW_P2, 0x00);
  nRF24_WriteReg(nRF24_REG_RX_PW_P3, 0x00);
  nRF24_WriteReg(nRF24_REG_RX_PW_P4, 0x00);
  nRF24_WriteReg(nRF24_REG_RX_PW_P5, 0x00);
  nRF24_WriteReg(nRF24_REG_DYNPD, 0x00);
  nRF24_WriteReg(nRF24_REG_FEATURE, 0x00);

  // Clear the FIFO's
  nRF24_FlushRX();
  nRF24_FlushTX();

  // Clear any pending interrupt flags
  nRF24_ClearIRQFlags();

  // Deassert CSN pin (chip release)
  nRF24_CSN_H();
}

uint8_t nRF24_Check(void)
// Return:
//   0: Fail
//   1: Success
{
  uint8_t rxbuf[5];
  uint8_t i;
  uint8_t *ptr = (uint8_t *) "nRF24";

  // Write test TX address and read TX_ADDR register
  nRF24_WriteMBReg(nRF24_REG_TX_ADDR, ptr, 5);
  nRF24_ReadMBReg(nRF24_REG_TX_ADDR, rxbuf, 5);

  // Compare buffers, return error on first mismatch
  for (i = 0; i < 5; i++)
  {
    if (rxbuf[i] != *ptr++)
      return 0;
  }

  return 1;
}

void nRF24_EnableInterrupts(uint8_t RX_DR, uint8_t TX_DS, uint8_t MAX_RT)
// JSB: Added.
{
  uint8_t Value;

  Value = nRF24_ReadReg(nRF24_REG_CONFIG);

  if (RX_DR)
    Value &= ~nRF24_CONFIG_RX_DR;
  else
    Value |= nRF24_CONFIG_RX_DR;

  if (TX_DS)
    Value &= ~nRF24_CONFIG_TX_DS;
  else
    Value |= nRF24_CONFIG_TX_DS;

  if (MAX_RT)
    Value &= ~nRF24_CONFIG_MAX_RT;
  else
    Value |= nRF24_CONFIG_MAX_RT;

  nRF24_WriteReg(nRF24_REG_CONFIG, Value);
}

int8_t nRF24_ConfigRegisterIsZero()
// JSB: Added. To identify that chip has crashed / got corrupted e.g. on STM32F769 board.
{
  uint8_t reg;

  reg = nRF24_ReadReg(nRF24_REG_CONFIG);

  return reg == 0x00;
}

// Control transceiver power mode
// input:
//   mode - new state of power mode, one of nRF24_PWR_xx values
void nRF24_SetPowerMode(nRF24_PWR value)
{
  uint8_t reg;

  reg = nRF24_ReadReg(nRF24_REG_CONFIG);
  if (value == nRF24_PWR_UP)
  {
    // Power up the transceiver.
    // It goes into Standby-I mode with current consumption of about 26uA.
    reg |= nRF24_CONFIG_PWR_UP;
  }
  else
  {
    // Power down the transceiver.
    // Current consumption is about 900nA.
    reg &= ~nRF24_CONFIG_PWR_UP;
  }
  nRF24_WriteReg(nRF24_REG_CONFIG, reg);
}

// Set transceiver operational mode
// input:
//   mode - operational mode, one of nRF24_MODE_xx values
void nRF24_SetOperationalMode(nRF24_MODE value)
{
  uint8_t reg;

  // Configure PRIM_RX bit of the CONFIG register
  reg = nRF24_ReadReg(nRF24_REG_CONFIG);
  reg &= ~nRF24_CONFIG_PRIM_RX;
  reg |= (value & nRF24_CONFIG_PRIM_RX );
  nRF24_WriteReg(nRF24_REG_CONFIG, reg);
}

void nRF24_SetCRCScheme(nRF24_CRC value)
// NB: Transceiver will forcibly turn on the CRC if auto acknowledgement is enabled for at least one RX pipe.
{
  uint8_t reg;

  // Configure EN_CRC[3] and CRCO[2] bits of the CONFIG register
  reg = nRF24_ReadReg(nRF24_REG_CONFIG);
  reg &= ~nRF24_MASK_CRC;
  reg |= (value | nRF24_MASK_CRC );
  nRF24_WriteReg(nRF24_REG_CONFIG, reg);
}

// Set frequency channel
// input:
//   channel - radio frequency channel, value from 0 to 127
// note: frequency will be (2400 + channel)MHz
// note: PLOS_CNT[7:4] bits of the OBSERVER_TX register will be reset
void nRF24_SetRFChannel(uint8_t channel)
{
  nRF24_WriteReg(nRF24_REG_RF_CH, channel);
}

void nRF24_GetAutoRetransmission(nRF24_ARD *ard, uint8_t *arc)
// JSB: Added
{
  uint8_t Value;

  Value = nRF24_ReadReg(nRF24_REG_SETUP_RETR);

  *ard = (Value >> 4);
  *arc = (Value & 0x0F);
}

// Set automatic retransmission parameters
// input:
//   ard - auto retransmit delay. One of nRF24_ARD_xx values.
//   arc - Number of auto retransmits. 0 to 15.
void nRF24_SetAutoRetransmission(nRF24_ARD ard, uint8_t arc)
{
  nRF24_WriteReg(nRF24_REG_SETUP_RETR, (uint8_t) ((ard << 4) | (arc & nRF24_MASK_RETR_ARC )));
}

uint8_t nRF24_GetAddressWidth()
// JSB: Added.
{
  int AddressWidth;

  AddressWidth = nRF24_ReadReg(nRF24_REG_SETUP_AW) + 2;

  if ((AddressWidth < 3) || (AddressWidth > 5))
    AddressWidth = 0;

  return AddressWidth;
}

// Set of address widths
// input:
//   addr_width - RX/TX address field width, value from 3 to 5
// note: this setting is common for all pipes
void nRF24_SetAddressWidth(uint8_t addr_width)
{
  nRF24_WriteReg(nRF24_REG_SETUP_AW, addr_width - 2);
}

uint64_t nRF24_GetAddress(nRF24_PIPE pipe)
// JSB: Added.
{
  uint8_t RXAddressBytes[5];
  uint8_t RXAddressByte;
  uint64_t Result = 0x00;

