JSB2500/STM32H743-Nucleo-projects/Shared-/nrf24.c
  if ((pipe >= nRF24_PIPE2) && (pipe <= nRF24_PIPE5))
  {
    Result = nRF24_GetAddress(nRF24_PIPE1);
    RXAddressByte = nRF24_ReadReg(nRF24_ADDR_REGS[pipe]);
    Result |= RXAddressByte;
  }
  else
  {
    nRF24_ReadMBReg(nRF24_ADDR_REGS[pipe], RXAddressBytes, nRF24_GetAddressWidth());

    for (int8_t ByteIndex = nRF24_GetAddressWidth() - 1; ByteIndex >= 0; --ByteIndex) // JSB: Index must be signed.
    {
      RXAddressByte = RXAddressBytes[ByteIndex];
      Result = Result << 8;
      Result |= RXAddressByte;
    }
  }
  return Result;
}

void nRF24_SetAddress(nRF24_PIPE pipe, const uint64_t address)
// JSB: Changed to use uint64_t address to end confusion about byte ordering, which is particularly a problem when trying to get this working with transceivers that use other libraries.
{
  uint8_t AddressWidth;

  switch(pipe)
  {
    case nRF24_PIPETX:
    case nRF24_PIPE0:
    case nRF24_PIPE1:
      AddressWidth = nRF24_GetAddressWidth();
      nRF24_WriteMBReg(nRF24_ADDR_REGS[pipe], (uint8_t *) &address, AddressWidth); // Assumes that "address" is stored little-endian.
      break;

    case nRF24_PIPE2:
    case nRF24_PIPE3:
    case nRF24_PIPE4:
    case nRF24_PIPE5:
      nRF24_WriteReg(nRF24_ADDR_REGS[pipe], address & 0xFF); // Write LSBbyte of address.
      break;

    default:
      // Incorrect pipe number -> do nothing
      break;
  }
}

nRF24_TXPWR nRF24_GetTXPower()
// JSB: Added.
{
  uint8_t RegisterValue = nRF24_ReadReg(nRF24_REG_RF_SETUP);

  return (RegisterValue & nRF24_MASK_TX_PWR );
}

void nRF24_GetTXPowerAsString(char *S)
// JSB: Added.
{
  switch(nRF24_GetTXPower())
  {
    case nRF24_TXPWR_Minus18dBm:
      sprintf(S, "-18dBm");
      break;
    case nRF24_TXPWR_Minus12dBm:
      sprintf(S, "-12dBm");
      break;
    case nRF24_TXPWR_Minus6dBm:
      sprintf(S, "-6dBm");
      break;
    case nRF24_TXPWR_0dBm:
      sprintf(S, "0dBm");
      break;
    default:
      sprintf(S, "<Error: Unhandled case>");
      UART_printf("Error: Unhandled case");
      break;
  }
}

void nRF24_SetTXPower(nRF24_TXPWR value)
{
  uint8_t reg;

  // Configure RF_PWR[2:1] bits of the RF_SETUP register
  reg = nRF24_ReadReg(nRF24_REG_RF_SETUP);
  reg &= ~nRF24_MASK_TX_PWR;
  reg |= value;
  nRF24_WriteReg(nRF24_REG_RF_SETUP, reg);
}

nRF24_DataRate nRF24_GetDataRate()
// JSB: Added.
{
  uint8_t RegisterValue = nRF24_ReadReg(nRF24_REG_RF_SETUP);

  return (RegisterValue & nRF24_MASK_DATARATE );
}

void nRF24_GetDataRateAsString(char *S)
// JSB: Added.
{
  switch(nRF24_GetDataRate())
  {
    case nRF24_DataRate_1Mbps:
      sprintf(S, "1Mbps");
      break;
    case nRF24_DataRate_2Mbps:
      sprintf(S, "2Mbps");
      break;
    case nRF24_DataRate_250kbps:
      sprintf(S, "250kbps");
      break;
    default:
      sprintf(S, "<Error: Unhandled case>");
      UART_printf("Error: Unhandled case");
      break;
  }
}

// Configure transceiver data rate
// input:
//   data_rate - data rate, one of nRF24_DR_xx values
void nRF24_SetDataRate(nRF24_DataRate data_rate)
{
  uint8_t reg;

  // Configure RF_DR_LOW[5] and RF_DR_HIGH[3] bits of the RF_SETUP register
  reg = nRF24_ReadReg(nRF24_REG_RF_SETUP);
  reg &= ~nRF24_MASK_DATARATE;
  reg |= data_rate;
  nRF24_WriteReg(nRF24_REG_RF_SETUP, reg);
}

// Configure a specified RX pipe
// input:
//   pipe - number of the RX pipe, value from 0 to 5
//   aa_state - state of auto acknowledgment, one of nRF24_AA_xx values
//   payload_len - payload length in bytes
void nRF24_SetRXPipe(nRF24_PIPE pipe, nRF24_AA aa_state, uint8_t payload_len)
{
  uint8_t reg;

  // Enable the specified pipe (EN_RXADDR register)
  reg = (nRF24_ReadReg(nRF24_REG_EN_RXADDR) | (1 << pipe)) & nRF24_MASK_EN_RX;
  nRF24_WriteReg(nRF24_REG_EN_RXADDR, reg);

  // Set RX payload length (RX_PW_Px register)
  nRF24_WriteReg(nRF24_RX_PW_PIPE[pipe], payload_len & nRF24_MASK_RX_PW);

  // Set auto acknowledgment for a specified pipe (EN_AA register)
  reg = nRF24_ReadReg(nRF24_REG_EN_AA);
  if (aa_state == nRF24_AA_ON)
  {
    reg |= (1 << pipe);
  }
  else
  {
    reg &= ~(1 << pipe);
  }
  nRF24_WriteReg(nRF24_REG_EN_AA, reg);
}

// Disable specified RX pipe
// input:
//   PIPE - number of RX pipe, value from 0 to 5
void nRF24_ClosePipe(nRF24_PIPE pipe)
{
  uint8_t reg;

  reg = nRF24_ReadReg(nRF24_REG_EN_RXADDR);
  reg &= ~(1 << pipe);
  reg &= nRF24_MASK_EN_RX;
  nRF24_WriteReg(nRF24_REG_EN_RXADDR, reg);
}

// Enable the auto retransmit (a.k.a. enhanced ShockBurst) for the specified RX pipe
// input:
//   pipe - number of the RX pipe, value from 0 to 5
void nRF24_EnableAA(nRF24_PIPE pipe)
{
  uint8_t reg;

  // Set bit in EN_AA register
  reg = nRF24_ReadReg(nRF24_REG_EN_AA);
  reg |= (1 << pipe);
  nRF24_WriteReg(nRF24_REG_EN_AA, reg);
}

// Disable the auto retransmit (a.k.a. enhanced ShockBurst) for one or all RX pipes
// input:
//   pipe - number of the RX pipe, value from 0 to 5, any other value will disable AA for all RX pipes
void nRF24_DisableAA(nRF24_PIPE pipe)
{
  uint8_t reg;

  if (pipe > 5)
  {
    // Disable Auto-ACK for ALL pipes
    nRF24_WriteReg(nRF24_REG_EN_AA, 0x00);
  }
  else
  {
    // Clear bit in the EN_AA register
    reg = nRF24_ReadReg(nRF24_REG_EN_AA);
    reg &= ~(1 << pipe);
    nRF24_WriteReg(nRF24_REG_EN_AA, reg);
  }
}

uint8_t nRF24_GetStatus(void)
{
  return nRF24_ReadReg(nRF24_REG_STATUS);
}

// Get pending IRQ flags
// return: current status of RX_DR, TX_DS and MAX_RT bits of the STATUS register
uint8_t nRF24_GetIRQFlags(void)
{
  return (nRF24_ReadReg(nRF24_REG_STATUS) & nRF24_MASK_STATUS_IRQ );
}

// Get status of the RX FIFO
nRF24_STATUS_RXFIFO nRF24_GetStatus_RXFIFO(void)
{
  return (nRF24_ReadReg(nRF24_REG_FIFO_STATUS) & nRF24_MASK_RXFIFO );
}

// Get status of the TX FIFO
// note: the TX_REUSE bit ignored
nRF24_STATUS_TXFIFO nRF24_GetStatus_TXFIFO(void)
{
  return ((nRF24_ReadReg(nRF24_REG_FIFO_STATUS) & nRF24_MASK_TXFIFO ) >> 4);
}

// Get pipe number for the payload available for reading from RX FIFO
// return: pipe number or 0x07 if the RX FIFO is empty
uint8_t nRF24_GetRXSource(void)
{
  return ((nRF24_ReadReg(nRF24_REG_STATUS) & nRF24_MASK_RX_P_NO ) >> 1);
}

void nRF24_GetRetransmitCounters(uint8_t *pLostPackets, uint8_t *pRetransmittedPackets)
{
  uint8_t reg;

  reg = nRF24_ReadReg(nRF24_REG_OBSERVE_TX);

  *pLostPackets = (reg & nRF24_MASK_PLOS_CNT ) >> 4;
  *pRetransmittedPackets = (reg & nRF24_MASK_ARC_CNT);
}

// Reset packet lost counter (PLOS_CNT bits in OBSERVER_TX register)
void nRF24_ResetPLOS(void)
{
  uint8_t reg;

  // The PLOS counter is reset after write to RF_CH register
  reg = nRF24_ReadReg(nRF24_REG_RF_CH);
  nRF24_WriteReg(nRF24_REG_RF_CH, reg);
}

// Flush the TX FIFO
void nRF24_FlushTX(void)
{
  nRF24_WriteReg(nRF24_CMD_FLUSH_TX, nRF24_CMD_NOP);
}

