JSB2500/STM32H743-Nucleo-projects/Shared-/nrf24.c
// Flush the RX FIFO
void nRF24_FlushRX(void)
{
  nRF24_WriteReg(nRF24_CMD_FLUSH_RX, nRF24_CMD_NOP);
}

// Clear any pending IRQ flags
void nRF24_ClearIRQFlags(void)
{
  uint8_t reg;

  // Clear RX_DR, TX_DS and MAX_RT bits of the STATUS register
  reg = nRF24_ReadReg(nRF24_REG_STATUS);
  reg |= nRF24_MASK_STATUS_IRQ;
  nRF24_WriteReg(nRF24_REG_STATUS, reg);
}

void nRF24_ClearIRQ_RX_DR_Flag(void)
// Added by JSB.
{
  uint8_t reg;

  reg = nRF24_ReadReg(nRF24_REG_STATUS);
  reg |= nRF24_STATUS_RX_DR;
  nRF24_WriteReg(nRF24_REG_STATUS, reg);
}

// Write TX payload
// input:
//   pBuf - pointer to the buffer with payload data
//   length - payload length in bytes
void nRF24_WritePayload(uint8_t *pBuf, uint8_t length)
{
  nRF24_WriteMBReg(nRF24_CMD_W_TX_PAYLOAD, pBuf, length);
}

// Read top level payload available in the RX FIFO
// input:
//   pBuf - pointer to the buffer to store a payload data
//   length - pointer to variable to store a payload length
// return: one of nRF24_RX_xx values
//   nRF24_RX_PIPEX - packet has been received from the pipe number X
//   nRF24_RX_EMPTY - the RX FIFO is empty
nRF24_RXResult nRF24_ReadPayload(uint8_t *pBuf, uint8_t *length)
{
  uint8_t pipe;

  // Extract a payload pipe number from the STATUS register
  pipe = (nRF24_ReadReg(nRF24_REG_STATUS) & nRF24_MASK_RX_P_NO ) >> 1;

  // RX FIFO empty?
  if (pipe < 6)
  {
    // Get payload length
    *length = nRF24_ReadReg(nRF24_RX_PW_PIPE[pipe]);

    // Read a payload from the RX FIFO
    if (*length)
    {
      nRF24_ReadMBReg(nRF24_CMD_R_RX_PAYLOAD, pBuf, *length);
    }

    return ((nRF24_RXResult) pipe);
  }

  // The RX FIFO is empty
  *length = 0;

  return nRF24_RX_EMPTY;
}

void nRF24_DumpConfiguration(void)
// Print nRF24L01+ current configuration (for debug purposes)
{
  uint8_t RegisterValue, j, PipeIndex;
  uint8_t AddressWidth;
  uint64_t RXTXAddress;
  char S[32];

  UART_printf("nRF24L01/nRF24L01+ configuration:\r\n");
  UART_printf("Begin\r\n");

  // CONFIG
  RegisterValue = nRF24_ReadReg(nRF24_REG_CONFIG);
  UART_printf("[0x%02X] 0x%02X CONFIG: Interrupt mask=%1X CRC enabled=%s CRC=%s Power=%s Mode=%s\r\n", nRF24_REG_CONFIG, RegisterValue, RegisterValue >> 4, (RegisterValue & 0x08) ? "Yes" : "No", (RegisterValue & 0x04) ? "2 bytes" : "1 byte", (RegisterValue & 0x02) ? "On" : "Off", (RegisterValue & 0x01) ? "RX" : "TX");

  // EN_AA
  RegisterValue = nRF24_ReadReg(nRF24_REG_EN_AA);
  UART_printf("[0x%02X] 0x%02X EN_AA: Enable auto-acknowledgement on pipe: ", nRF24_REG_EN_AA, RegisterValue);
  for (j = 0; j < 6; j++)
  {
    UART_printf("[P%1u%s]%s", j, (RegisterValue & (1 << j)) ? "+" : "-", (j == 5) ? "\r\n" : " ");
  }

  // EN_RXADDR
  RegisterValue = nRF24_ReadReg(nRF24_REG_EN_RXADDR);
  UART_printf("[0x%02X] 0x%02X EN_RXADDR: Enable RX pipe: ", nRF24_REG_EN_RXADDR, RegisterValue);
  for (j = 0; j < 6; j++)
  {
    UART_printf("[P%1u%s]%s", j, (RegisterValue & (1 << j)) ? "+" : "-", (j == 5) ? "\r\n" : " ");
  }

  // SETUP_AW
  RegisterValue = nRF24_ReadReg(nRF24_REG_SETUP_AW);
  AddressWidth = (RegisterValue & 0x03) + 2;
  UART_printf("[0x%02X] 0x%02X SETUP_AW: Address width=%u\r\n", nRF24_REG_SETUP_AW, RegisterValue, AddressWidth);

  // SETUP_RETR
  RegisterValue = nRF24_ReadReg(nRF24_REG_SETUP_RETR);
  uint8_t ard, arc;
  nRF24_GetAutoRetransmission(&ard, &arc);
  UART_printf("[0x%02X] 0x%02X SETUP_RETR ARD=%d (%uus) ARC=%d\r\n", nRF24_REG_SETUP_RETR, RegisterValue, ard, (ard * 250) + 250, arc);

  // RF_CH
  RegisterValue = nRF24_ReadReg(nRF24_REG_RF_CH);
  UART_printf("[0x%02X] 0x%02X RF_CH: Channel=%d (0x%02X) Frequency=%.3uGHz\r\n", nRF24_REG_RF_CH, RegisterValue, RegisterValue, RegisterValue, 2400 + RegisterValue);

  // RF_SETUP
  RegisterValue = nRF24_ReadReg(nRF24_REG_RF_SETUP);
  UART_printf("[0x%02X] 0x%02X RF_SETUP: CONT_WAVE=%s PLL_LOCK=%s", nRF24_REG_RF_SETUP, RegisterValue, (RegisterValue & 0x80) ? "On" : "Off", (RegisterValue & 0x80) ? "On" : "Off");
  nRF24_GetDataRateAsString(S);
  UART_printf(" DataRate=%s", S);
  nRF24_GetTXPowerAsString(S);
  UART_printf(" RF power=%s\r\n", S);

  // STATUS
  RegisterValue = nRF24_ReadReg(nRF24_REG_STATUS);
  UART_printf("[0x%02X] 0x%02X STATUS: IRQ=%01X RX_PIPE=%u TX_FULL=%s\r\n", nRF24_REG_STATUS, RegisterValue, (RegisterValue & 0x70) >> 4, (RegisterValue & 0x0E) >> 1, (RegisterValue & 0x01) ? "Yes" : "No");

  // OBSERVE_TX
  RegisterValue = nRF24_ReadReg(nRF24_REG_OBSERVE_TX);
  UART_printf("[0x%02X] 0x%02X PLOS_CNT=%u ARC_CNT=%u\r\n", nRF24_REG_OBSERVE_TX, RegisterValue, RegisterValue >> 4, RegisterValue & 0x0F);

  // RPD
  RegisterValue = nRF24_ReadReg(nRF24_REG_RPD);
  UART_printf("[0x%02X] 0x%02X RPD=%s\r\n", nRF24_REG_RPD, RegisterValue, (RegisterValue & 0x01) ? "Yes" : "No");

  // RX_ADDR_P0 to RX_ADDR_P5
  for (PipeIndex = 0; PipeIndex < 6; ++PipeIndex)
  {
    RXTXAddress = nRF24_GetAddress(nRF24_PIPE0 + PipeIndex);
    UART_printf("[0x%02X] RX_ADDR_P%d=0x%01X%08X\r\n", nRF24_REG_RX_ADDR_P0 + PipeIndex, PipeIndex, (uint32_t) (RXTXAddress >> 32), (uint32_t) RXTXAddress); // JSB: I couldn't get PRIx64 to work. Perhaps this printf does not support 64 bit integers.
  }

  // TX_ADDR
  RXTXAddress = nRF24_GetAddress(nRF24_PIPETX);
  UART_printf("[0x%02X] TX_ADDR=0x%01X%08X\r\n", nRF24_REG_TX_ADDR, (uint32_t) (RXTXAddress >> 32), (uint32_t) RXTXAddress); // JSB: I couldn't get PRIx64 to work. Perhaps this printf does not support 64 bit integers.

  for (PipeIndex = 0; PipeIndex < 6; ++PipeIndex)
  {
    RegisterValue = nRF24_ReadReg(nRF24_REG_RX_PW_P0 + PipeIndex);
    UART_printf("[0x%02X] RX_PW_P%d=%u\r\n", nRF24_REG_RX_PW_P0 + PipeIndex, PipeIndex, RegisterValue);
  }

  UART_printf("End\r\n\r\n");
}

void nRF24_DumpRegisters(void)
// JSB: Added.
{
  uint8_t RegisterAddress, RegisterValue, AddressWidth;
  uint8_t RXAddressBytes[5];

  UART_printf("nRF24L01/nRF24L01+ registers:\r\n");
  UART_printf("Begin\r\n");

  for (RegisterAddress = 0x00; RegisterAddress <= 0x1D; ++RegisterAddress)
  {
    UART_printf("0x%02X: ", RegisterAddress);

    switch(RegisterAddress)
    {
      case nRF24_REG_RX_ADDR_P0 :
      case nRF24_REG_RX_ADDR_P1 :
      case nRF24_REG_TX_ADDR :
        AddressWidth = nRF24_GetAddressWidth();
        nRF24_ReadMBReg(RegisterAddress, RXAddressBytes, AddressWidth);
        for (int ByteIndex = 0; ByteIndex < AddressWidth; ++ByteIndex)
          UART_printf("0x%02X ", RXAddressBytes[ByteIndex]);
        UART_printf("[LSB to MSB]");
        break;

      case 0x18:
      case 0x19:
      case 0x1A:
      case 0x1B:
        // Payload registers.
        break;

      default:
        RegisterValue = nRF24_ReadReg(RegisterAddress);
        UART_printf("0x%02X", RegisterValue);
    }

    UART_printf("\r\n");
  }
  UART_printf("End\r\n\r\n");
}
